In [1]:
import pandas as pd
table=pd.read_csv("./moon.csv")
table

,Year,Month,Day,Location,Description,Credit
0,1540,Nov,26,Region of Calippus,Starlike appearance on dark side,Observers at Worms
1,1587,Mar,5,Dark Side,A sterre is sene in the bodie of the moon vpon...,Anonymous
2,1668,Nov,26,Dark Side,Bright starlike point,Several New Englanders
3,1671,Oct,21,Pitatus,NaN,NaN
4,1671,Nov,12,Pitatus,Small whitish cloud,D.Cassini
...,...,...,...,...,...,...
531,1967,Sep,11,Mare Tranquilitaties: 8-9 sec,Black cloud surrounded by violet color,Montreal group
532,1967,Sep,11,Sabine,Bright yellow flash visible a fraction of a se...,Mrs P.Jean and Montreal group
533,1967,Sep,17,Aristarchus,Red color observed,Delano
534,1967,Oct,10,SE of Ross D,Bright area moved 80 kmhr toward SSE and expan...,Harris
535,1967,Oct,19,Kepler,Aristarchus,High moon

In [2]:
table.head()

,Year,Month,Day,Location,Description,Credit
0,1540,Nov,26,Region of Calippus,Starlike appearance on dark side,Observers at Worms
1,1587,Mar,5,Dark Side,A sterre is sene in the bodie of the moon vpon...,Anonymous
2,1668,Nov,26,Dark Side,Bright starlike point,Several New Englanders
3,1671,Oct,21,Pitatus,NaN,NaN
4,1671,Nov,12,Pitatus,Small whitish cloud,D.Cassini

In [3]:
table.tail()

,Year,Month,Day,Location,Description,Credit
531,1967,Sep,11,Mare Tranquilitaties: 8-9 sec,Black cloud surrounded by violet color,Montreal group
532,1967,Sep,11,Sabine,Bright yellow flash visible a fraction of a se...,Mrs P.Jean and Montreal group
533,1967,Sep,17,Aristarchus,Red color observed,Delano
534,1967,Oct,10,SE of Ross D,Bright area moved 80 kmhr toward SSE and expan...,Harris
535,1967,Oct,19,Kepler,Aristarchus,High moon

In [4]:
 type(table)

pandas.core.frame.DataFrame

In [5]:
table.head().to_csv("test.csv")

In [17]:
t=pd.read_csv("./test.csv",sep="#",header=None,names=['a','b','c','d','e','f','g','h'],skiprows=[0,3,4,5])
t

,a,b,c,d,e,f,g,h
0,0,1540,Nov,26,Region of Calippus,Starlike appearance on dark side,Observers at Worms,NaN
1,1,1587,Mar,5,Dark Side,A sterre is sene in the bodie of the moon vpon...,Anonymous,NaN

In [18]:
df=pd.read_csv("./test.csv",sep="#",na_values=["Nov"])
df

,Unnamed: 0,Year,Month,Day,Location,Description,Credit
0,0,1540,NaN,26,Region of Calippus,Starlike appearance on dark side,Observers at Worms
1,1,1587,Mar,5,Dark Side,A sterre is sene in the bodie of the moon vpon...,Anonymous
2,2,1668,NaN,26,Dark Side,Bright starlike point,Several New Englanders
3,3,1671,Oct,21,Pitatus,NaN,NaN
4,4,1671,NaN,12,Pitatus,Small whitish cloud,D.Cassini

In [19]:
 table.describe()

              Year         Day
count   536.000000  536.000000
mean   1915.434701   15.779851
std      66.694557    9.122635
min    1540.000000    0.000000
25%    1883.750000    8.000000
50%    1950.500000   16.000000
75%    1963.000000   24.000000
max    1967.000000   31.000000

In [20]:
table[["Year","Month"]]

     Year Month
0    1540   Nov
1    1587   Mar
2    1668   Nov
3    1671   Oct
4    1671   Nov
..    ...   ...
531  1967   Sep
532  1967   Sep
533  1967   Sep
534  1967   Oct
535  1967   Oct

[536 rows x 2 columns]

In [24]:
html=pd.read_html("https://www.basketball-reference.com/tools/share.fcgi?id=DUH98")
html

[   Rk           Player  From    To    G   GS     MP   FG   FGA    FG%  ...  \
 0   1      Serge Ibaka  2010  2016  484  373  13820  8.7  16.4  0.529  ...
 1   2  Markieff Morris  2012  2016  332  137   8342  8.8  19.9  0.444  ...

     TRB  AST  STL  BLK  TOV   PF   PTS  Unnamed: 28  ORtg  DRtg
 0  13.2  1.0  0.7  4.6  2.3  5.1  20.6          NaN   114   102
 1  10.7  3.4  1.8  1.2  3.3  5.6  22.7          NaN   102   106

 [2 rows x 31 columns]]

In [25]:
type(html)

list

In [26]:
len(html)

1

In [27]:
html[0]

,Rk,Player,From,To,G,GS,MP,FG,FGA,FG%,...,TRB,AST,STL,BLK,TOV,PF,PTS,Unnamed: 28,ORtg,DRtg
0,1,Serge Ibaka,2010,2016,484,373,13820,8.7,16.4,0.529,...,13.2,1.0,0.7,4.6,2.3,5.1,20.6,NaN,114,102
1,2,Markieff Morris,2012,2016,332,137,8342,8.8,19.9,0.444,...,10.7,3.4,1.8,1.2,3.3,5.6,22.7,NaN,102,106

In [29]:
html

[   Rk           Player  From    To    G   GS     MP   FG   FGA    FG%  ...  \
 0   1      Serge Ibaka  2010  2016  484  373  13820  8.7  16.4  0.529  ...
 1   2  Markieff Morris  2012  2016  332  137   8342  8.8  19.9  0.444  ...

     TRB  AST  STL  BLK  TOV   PF   PTS  Unnamed: 28  ORtg  DRtg
 0  13.2  1.0  0.7  4.6  2.3  5.1  20.6          NaN   114   102
 1  10.7  3.4  1.8  1.2  3.3  5.6  22.7          NaN   102   106

 [2 rows x 31 columns]]

In [28]:
t1=pd.DataFrame(table)

t1.dtypes

Year            int64
Month          object
Day             int64
Location       object
Description    object
Credit         object
dtype: object

In [32]:
t1.dtypes=="object"

Year           False
Month           True
Day            False
Location        True
Description     True
Credit          True
dtype: bool

In [39]:
t1[t1.dtypes[t1.dtypes=="object"].index]

,Month,Location,Description,Credit
0,Nov,Region of Calippus,Starlike appearance on dark side,Observers at Worms
1,Mar,Dark Side,A sterre is sene in the bodie of the moon vpon...,Anonymous
2,Nov,Dark Side,Bright starlike point,Several New Englanders
3,Oct,Pitatus,NaN,NaN
4,Nov,Pitatus,Small whitish cloud,D.Cassini
...,...,...,...,...
531,Sep,Mare Tranquilitaties: 8-9 sec,Black cloud surrounded by violet color,Montreal group
532,Sep,Sabine,Bright yellow flash visible a fraction of a se...,Mrs P.Jean and Montreal group
533,Sep,Aristarchus,Red color observed,Delano
534,Oct,SE of Ross D,Bright area moved 80 kmhr toward SSE and expan...,Harris
535,Oct,Kepler,Aristarchus,High moon

In [42]:
t1.dtypes[t1.dtypes=="object"]

Month          object
Location       object
Description    object
Credit         object
dtype: object

In [4]:
table.columns

Index(['Year', 'Month', 'Day', 'Location', 'Description', 'Credit'], dtype='object')

In [6]:
table.iloc[[1,2,3]]

,Year,Month,Day,Location,Description,Credit
1,1587,Mar,5,Dark Side,A sterre is sene in the bodie of the moon vpon...,Anonymous
2,1668,Nov,26,Dark Side,Bright starlike point,Several New Englanders
3,1671,Oct,21,Pitatus,NaN,NaN

In [7]:
t2=pd.read_csv("moon.csv")
t2

,Year,Month,Day,Location,Description,Credit
0,1540,Nov,26,Region of Calippus,Starlike appearance on dark side,Observers at Worms
1,1587,Mar,5,Dark Side,A sterre is sene in the bodie of the moon vpon...,Anonymous
2,1668,Nov,26,Dark Side,Bright starlike point,Several New Englanders
3,1671,Oct,21,Pitatus,NaN,NaN
4,1671,Nov,12,Pitatus,Small whitish cloud,D.Cassini
...,...,...,...,...,...,...
531,1967,Sep,11,Mare Tranquilitaties: 8-9 sec,Black cloud surrounded by violet color,Montreal group
532,1967,Sep,11,Sabine,Bright yellow flash visible a fraction of a se...,Mrs P.Jean and Montreal group
533,1967,Sep,17,Aristarchus,Red color observed,Delano
534,1967,Oct,10,SE of Ross D,Bright area moved 80 kmhr toward SSE and expan...,Harris
535,1967,Oct,19,Kepler,Aristarchus,High moon

In [13]:
w=t2[["Month"]][t2["Year"]==max(t2["Year"])]

In [14]:
t2.iloc[w.index]

,Year,Month,Day,Location,Description,Credit
515,1967,Jan,21,Gassendi,Small blink and suspect faint colored patch in...,Apr
516,1967,Feb,17,Alphonsus: 25 min,Blink just inside the SW floor of crater suspe...,Moore
517,1967,Feb,19,Moseley,Moore,B.A.A. Lunar Sec. Circ. 1967
518,1967,Mar,22,Gassendi,Red color and blink,Moseley
519,1967,Mar,23,Gassendi,Red color under S wall,Sartory
520,1967,Mar,23,Cobrahead,Red color outside SE wall,Moore
521,1967,Mar,23,Aristarchus,Red glows,Sartory
522,1967,Apr,15,Aristarchus (on dark side): 1 hr 45 min,Aristarchus very bright. Seeing very good unti...,after which seeing too bad to continue observi...
523,1967,Apr,21,Aristarchus: 1 hr 59 min,Bright points on S wall. Red patch to NE,Darnell
524,1967,Apr,21,Schroters Valley,Cobrahead,Red color
525,1967,Apr,22,Aristarchus (on bright side),Aristarchus so bright that it could be seen wi...,Classen
526,1967,May,20,Aristarchus: 15 min,Red spots on south rim. Moon low,Darnell
527,1967,May,20,Gassendi,Elongated blink in crater,SW part of floor
528,1967,May,29,Aristarchus: 45 min,Red-brown color,C.A. Anderson
529,1967,Jun,18,Gassendi: 1 hr 20 min and 1 hr 9 min,Faint redness outside the NW and SW wall of Ga...,Whippey
530,1967,Aug,13,Alphonsus: 15 min,Glow in interior of crater,Horowitz
531,1967,Sep,11,Mare Tranquilitaties: 8-9 sec,Black cloud surrounded by violet color,Montreal group
532,1967,Sep,11,Sabine,Bright yellow flash visible a fraction of a se...,Mrs P.Jean and Montreal group
533,1967,Sep,17,Aristarchus,Red color observed,Delano
534,1967,Oct,10,SE of Ross D,Bright area moved 80 kmhr toward SSE and expan...,Harris
535,1967,Oct,19,Kepler,Aristarchus,High moon